model {
  faster_rcnn {
    num_classes: 3
    image_resizer {
        keep_aspect_ratio_resizer {
        min_dimension: 1280
        max_dimension: 1920
      }
    }
    feature_extractor {
      type: "faster_rcnn_resnet101"
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      regions_grid_anchor_generator {
        height_stride: 16
        width_stride: 16
        regions_limits: 0.17
        regions_limits: 0.40
        regions_limits: 0.70
        scales{
         floats: 0.06
         floats: 0.11036
         floats: 0.196657
         floats: 0.360178
        }
        scales {
         floats: 0.06974
         floats: 0.13669
         floats: 0.248809
         floats: 0.474911
        }
        scales{
         floats: 0.07002
         floats: 0.1447
         floats: 0.2881
         floats: 0.64271
        }
        scales{
         floats: 0.6936
         floats: 1.2549
         floats: 1.9353
         floats: 2.8861
        }
        aspect_ratios{
         floats: 0.37788
         floats: 0.76
         floats: 1.82974
        }
        aspect_ratios{
         floats: 0.37657
         floats: 0.7821
         floats: 2.080698
        }
        aspect_ratios{
         floats: 0.4081
         floats: 0.83919
         floats: 2.2826
        }
        aspect_ratios{
         floats: 0.32057
         floats: 0.76915
         floats: 2.1001
        }
        special_cases{
         floats: 0.5
         floats: 0.5
         floats: 0
         floats: 6.1
         floats: 0.6666
        }
        special_cases{
         floats: 0.25
         floats: 0.5
         floats: 0
         floats: 4.3
         floats: 1.3333
        }
        special_cases{
         floats: 0.75
         floats: 0.5
         floats: 0
         floats: 4.3
         floats: 1.3333
        }
        special_cases{
         floats: 0.5
         floats: 0.25
         floats: 0
         floats: 4.3
         floats: 0.3333
        }
        special_cases{
         floats: 0.5
         floats: 0.75
         floats: 0
         floats: 4.3
         floats: 0.3333
        }
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.001
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 500
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_batch_size: 256
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
        use_extra_features: true
      }
    }
     first_stage_objectness_loss{
        weighted_softmax_reduced_focal{
           gamma: 2
           alpha: 0.25
           threshold: 0.5
       }
    }
    second_stage_classification_loss{
       weighted_softmax_reduced_focal{
           gamma: 2
           alpha: 0.25
           threshold: 0.25
       }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.300000011921
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}
train_config {
  batch_size: 1
  data_augmentation_options {
    random_horizontal_flip {
    }
   }
optimizer {
    momentum_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.000300000014249
          schedule {
            step: 50
            learning_rate: 0.000300000014249
          }
          schedule {
            step: 200000
            learning_rate: 2.99999992421e-05
          }
          schedule {
            step: 400000
            learning_rate: 3.00000010611e-06
          }
        }
      }
      momentum_optimizer_value: 0.899999976158
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "saved_models/faster_rcnn_resnet101_coco_2018_01_28/model.ckpt"
  from_detection_checkpoint: true
}
train_input_reader {
  label_map_path: "data/camera_data/label_map.pbtxt"
  tf_record_input_reader {
  input_path: "data/camera_data/training/training.record-?????-of-00798"
}
}
eval_config {
  use_moving_averages: false
  retain_original_image_additional_channels: false
  retain_original_images: false
  num_visualizations: 0
}

eval_input_reader {
  name: "training"
  label_map_path: "data/camera_data/label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "data/camera_data/training/training.record-?????-of-00798"
  }
}

eval_input_reader {
  name: "validation"
  label_map_path: "data/camera_data/label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "data/camera_data/validation/validation.record-00000-of-00202"
  }
}
